## Just playing around with the data

Lesson learned: 
* sqlite3 is super limited. If I were to redo this I'd save it all in a MySQL or pSQL database tp have access to more core functionalities.
* plotly is nice for graphs, however it is hard to show notebooks that uses it in github. One must use nbviewer.

In [33]:
import numpy as np
import pandas as pd
import plotly.plotly as py
import plotly.graph_objs as go
from plotly.tools import FigureFactory as FF 
from IPython.display import display, display_pretty, Javascript, HTML
import qgrid 
qgrid.nbinstall(overwrite=True)

In [8]:
%load_ext sql
%config SqlMagic.autopandas=True
%matplotlib inline

# %qtconsole

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [6]:
%sql sqlite:///data/sales.db

u'Connected: None@data/sales.db'

### Some usefule SQL queries

_Note that sqlite3 is quite limited as a sql db. e.g. it doesn't support variables and a lot of functions (mean, std..) offered by other db (MySQL, postgreSQL, etc.). So queries below are simple, or I use python to access more complex information.

#### Get unique entries for all dates (either new, or sold cars)
```SQL
select count(line_id) ss, min(line_id), * 
from salesVR 
group by year, make, model, trim, mileage 
having ss = 1 
order by make, model, trim, year;
```

#### Get unique entries for all dates (either new, or sold cars)
```SQL
select date, count(ss) from
(select count(line_id) ss, min(line_id), * 
from salesVR 
group by year, make, model, trim, mileage 
having ss = 1) A
group by date
;
```
        * 2016-09-12  260 (cars sold in 3 days..?)
        * 2016-09-15  250 (new cars added to catalog in 3 days?)

## See what cars have been sold and added each days

I'm assuming, perhaps simplistically, that cars taken of of the catalog have been sold.

## Plot Brand average price 
First get list of individual cars, then average per make. Most cars will show up every day because they haven't been sold. The price for some of these cars are changing so I first take the average over the 4 days for each cars.

To find unique cars I group by year, make, model, trim, mileage. This assumes that mileage doesn't change but that price can. 

_ Values for Trader 1 are very biased towards more expensive cars as the search only outputs the top 1000 cars, sorted from most expensice to least, out of ~14000 cars._ **So this is just a quick demonstration, not an in-depth analysis.**

### VR
```SQL
select make, count(make) num_cars, sum(price)/count(price) ave_price, 
        max(price) max_price, min(price) min_price
from 
(select make, sum(price)/count(price) price from salesVR
group by year, make, model, trim, mileage) DAY
group by make
order by ave_price;
```

### Trader 1
```SQL
select make, sum(AVE)/count(AVE) ave_price from
(select count(make) CC, make, type, mileage, sum(price)/count(price) AVE
from sales
group by
make, type, mileage having mileage not like 'Null') IND
group by make
order by ave_price;
```

In [27]:
make_ave_price_VR = %sql select make, count(make) num_cars, sum(price)/count(price) ave_price from (select make, sum(price)/count(price) price from salesVR group by year, make, model, trim, mileage) DAY group by make order by ave_price;
make_ave_price_T1 = %sql select make, sum(AVE)/count(AVE) ave_price from (select count(make) CC, make, type, mileage, sum(price)/count(price) AVE from sales group by make, type, mileage having mileage not like 'Null') IND group by make order by ave_price;

#Plot VR
data = [go.Bar(
            x=make_ave_price_VR["make"],
            y=make_ave_price_VR["ave_price"]
    )]

layout = go.Layout(
    title = 'VR - Average Car Price per Make (US$)')

fig = go.Figure(data=data, layout=layout)
py.iplot(fig, filename='VR_average_make')

Done.
Done.

In [25]:
#Plot T1
data = [go.Bar(
            x=make_ave_price_T1["make"],
            y=make_ave_price_T1["ave_price"]
    )]

layout = go.Layout(
    title = 'Trader 1 - Average Car Price per Make (US$)')

fig2 = go.Figure(data=data, layout=layout)
py.iplot(fig2, filename='VR_average_make')

### Compare average prices for all brands
Use temp tables from above. Also sqlite doesn't do full outer joins, so we have to get _**creative**_.

With more scraped data, this could be done based on location (zipcode), year, model, mileage, etc.

```SQL
select coalesce(makeVR,makeT1) make , price_VR, price_T1 from
(select VR.make makeVR, T1.make makeT1, VR.ave_price_VR price_VR, T1.ave_price_T1 price_T1
from
(select make, sum(price)/count(price) ave_price_VR
from 
(select make, sum(price)/count(price) price from salesVR
group by year, make, model, trim, mileage) DAY
group by make) VR
left join
(select make, sum(AVE)/count(AVE) ave_price_T1 from
(select count(make) CC, make, type, mileage, sum(price)/count(price) AVE
from sales
group by
make, type, mileage having mileage not like 'Null') IND
group by make) T1
on Vr.make = T1.make
UNION ALL
select VRb.make, T1b.make, VRb.ave_price_VR, T1b.ave_price_T1
from
(select make, sum(AVE)/count(AVE) ave_price_T1 from
(select count(make) CC, make, type, mileage, sum(price)/count(price) AVE
from sales
group by
make, type, mileage having mileage not like 'Null') IND
group by make) T1b
left join
(select make, sum(price)/count(price) ave_price_VR
from 
(select make, sum(price)/count(price) price from salesVR
group by year, make, model, trim, mileage) DAY
group by make) VRb
on VRb.make = T1b.make
where VRb.make IS NULL)
order by make
;
```

In [37]:
compare_prices = %sql select coalesce(makeVR,makeT1) make , price_VR, price_T1 from (select VR.make makeVR, T1.make makeT1, VR.ave_price_VR price_VR, T1.ave_price_T1 price_T1 from (select make, sum(price)/count(price) ave_price_VR from  (select make, sum(price)/count(price) price from salesVR group by year, make, model, trim, mileage) DAY group by make) VR left join (select make, sum(AVE)/count(AVE) ave_price_T1 from (select count(make) CC, make, type, mileage, sum(price)/count(price) AVE from sales group by make, type, mileage having mileage not like 'Null') IND group by make) T1 on Vr.make = T1.make UNION ALL select VRb.make, T1b.make, VRb.ave_price_VR, T1b.ave_price_T1 from (select make, sum(AVE)/count(AVE) ave_price_T1 from (select count(make) CC, make, type, mileage, sum(price)/count(price) AVE from sales group by make, type, mileage having mileage not like 'Null') IND group by make) T1b left join (select make, sum(price)/count(price) ave_price_VR from  (select make, sum(price)/count(price) price from salesVR group by year, make, model, trim, mileage) DAY group by make) VRb on VRb.make = T1b.make where VRb.make IS NULL) order by make;
# qgrid.show_grid(compare_prices)
compare_prices.set_index("make", drop=True,inplace = True)
table = FF.create_table(compare_prices, index=True, index_title = 'Make')
py.iplot(table, filename='linked_table')

Done.

### Look at price variations in VR catalog

Some cars exhibit price drops during the week data was scraped. Here I do a quick analysis of the price drops behavior to get an insight into VR's pricing strategy. 

**Note that I got a bit sick of SQLite3 limited functionalities so I've converted the sqlite db into a local mySQL db using a python script from http://www.redmine.org/boards/2/topics/12793?r=24999**.

command:
```bash
sqlite3 sales.db .dump | sqlite3-to-mysql.py | mysql -u JFBG -p VR
```

With MySQL I can use auto-incremented variables to assign a unique id to all cars, making sure that cars with several rows (cars showing up everyday) get assign the same car id. I ran these directly in MySQL terminal window. 

#### Create table listing all individual cars and assigning unique car_id (NEW TABLE VR_unique)
This assumes that no 2 cars with same year, make, model, trim have same mileage.
```SQL
set @car_id = 1;

CREATE TABLE VR_unique
select @car_id := @car_id + 1 id, year,
    make, trim, model, mileage from
(select year, make, trim, model, mileage from salesVR
group by year, make, trim, model, mileage) A
order by id;
```

#### Assigning car id to all rows in catalog table (NEW TABLE VR_catalog)
```SQL
CREATE TABLE VR_catalog
SELECT VR_unique.id, salesVR.date, salesVR.year, salesVR.make,
    salesVR.model, salesVR.trim, salesVR.mileage, 
    salesVR.price
FROM VR_unique 
JOIN
salesVR
ON VR_unique.make = salesVR.make
AND VR_unique.model = salesVR.model
AND VR_unique.trim = salesVR.trim
AND VR_unique.mileage = salesVR.mileage;
```


#### Build DataFrame with 4 columns showing the price of the car on each day.
Not super useful per say in SQL because you can't easily do operation on rows. But it works well with pd DataFrames. Also I would use a different approach if we had more than 4 days (e.g. several months..) because this is not a super efficient query...

```SQL
select V1.id id, V1.price price12, V2.price price15, V3.price price16, V4.price price18
from VR_catalog V1, VR_catalog V2, VR_catalog V3, VR_catalog V4
WHERE V1.date = '2016-09-12'
AND V2.date = '2016-09-15'
AND V3.date = '2016-09-16'
AND V4.date = '2016-09-18'
AND V1.id = V2.id
AND V2.id = V3.id
AND V3.id = V4.id
```

In [40]:
# connect to local MySQL server
%sql mysql://JFBG:123456yyt@localhost/VR

u'Connected: JFBG@VR'

In [41]:
prices_day = %sql JFBG@VR select V1.id id, V1.price price12, V2.price price15, V3.price price16, V4.price price18 from VR_catalog V1, VR_catalog V2, VR_catalog V3, VR_catalog V4 WHERE V1.date = '2016-09-12' AND V2.date = '2016-09-15' AND V3.date = '2016-09-16' AND V4.date = '2016-09-18' AND V1.id = V2.id AND V2.id = V3.id AND V3.id = V4.id

2111 rows affected.

The query below is very very not pretty, and not optimal but the resulting table is useful. It lists the price of each car on each day of the survey (09/12, 09/15, 09/16 and 09/18). We can easily query it to see which cars have been sold on each day, which car have been added on each day, check how the prices evolved, and so on.

There probably is an easier way to do this. But I waned to make sure to have entries even or cars that were not there on all 4 days (as the query does not do.)

```SQL
CREATE table VR_prices 
select id, avg(price12) price12, avg(price15) price15, 
    avg(price16) price16, avg(price18) price18 from 
(select V123.id id, V123.price12, V123.price15, V123.price16, V4.price price18 from
(select V12.id id, V12.price12, V12.price15, V3.price price16 from
(select V1.id id, V1.price price12, V2.price price15
from (select id, price from VR_catalog where date = '2016-09-12') V1
left join (select id, price from VR_catalog where date = '2016-09-15') V2
on V1.id = V2.id
UNION ALL
select V2.id id, V1.price price12, V2.price price15
from (select id, price from VR_catalog where date = '2016-09-12') V1
right join (select id, price from VR_catalog where date = '2016-09-15') V2
on V1.id = V2.id) V12
left join (select id, price from VR_catalog where date = '2016-09-16') V3
on V12.id = V3.id
UNION ALL
select V3.id id, V12.price12, V12.price15, V3.price price16 from
(select V1.id id, V1.price price12, V2.price price15
from (select id, price from VR_catalog where date = '2016-09-12') V1
left join (select id, price from VR_catalog where date = '2016-09-15') V2
on V1.id = V2.id
UNION ALL
select V2.id id, V1.price price12, V2.price price15
from (select id, price from VR_catalog where date = '2016-09-12') V1
right join (select id, price from VR_catalog where date = '2016-09-15') V2
on V1.id = V2.id) V12
right join (select id, price from VR_catalog where date = '2016-09-16') V3
on V12.id = V3.id) V123
left join (select id, price from VR_catalog where date = '2016-09-18') V4
on V123.id = V4.id
UNION ALL
select V4.id id, V123.price12, V123.price15, V123.price16, V4.price price18 from
(select V12.id id, V12.price12, V12.price15, V3.price price16 from
(select V1.id id, V1.price price12, V2.price price15
from (select id, price from VR_catalog where date = '2016-09-12') V1
left join (select id, price from VR_catalog where date = '2016-09-15') V2
on V1.id = V2.id
UNION ALL
select V2.id id, V1.price price12, V2.price price15
from (select id, price from VR_catalog where date = '2016-09-12') V1
right join (select id, price from VR_catalog where date = '2016-09-15') V2
on V1.id = V2.id) V12
left join (select id, price from VR_catalog where date = '2016-09-16') V3
on V12.id = V3.id
UNION ALL
select V3.id id, V12.price12, V12.price15, V3.price price16 from
(select V1.id id, V1.price price12, V2.price price15
from (select id, price from VR_catalog where date = '2016-09-12') V1
left join (select id, price from VR_catalog where date = '2016-09-15') V2
on V1.id = V2.id
UNION ALL
select V2.id id, V1.price price12, V2.price price15
from (select id, price from VR_catalog where date = '2016-09-12') V1
right join (select id, price from VR_catalog where date = '2016-09-15') V2
on V1.id = V2.id) V12
right join (select id, price from VR_catalog where date = '2016-09-16') V3
on V12.id = V3.id) V123
right join (select id, price from VR_catalog where date = '2016-09-18') V4
on V123.id = V4.id) V1234
group by id
order by id;
```

For example in the table below we can see that cars #4, 5, 8, 12, 14 we sold on 09/12

In [49]:
all_prices = %sql JFBG@VR select * from VR_prices limit 15;
all_prices.head(15)

15 rows affected.

    id      price12      price15      price16      price18
0    2   27980.0000   27980.0000   27980.0000   27980.0000
1    3  212980.0000  212980.0000  212980.0000  212980.0000
2    4   18980.0000   19980.0000   19980.0000   19980.0000
3    5   18980.0000   18980.0000   18980.0000   18980.0000
4    6   24780.0000         None         None         None
5    7   12980.0000         None         None         None
6    8   34780.0000   34780.0000   34780.0000   34780.0000
7    9   26980.0000   26980.0000   26980.0000   26980.0000
8   10   18780.0000         None         None         None
9   11   30980.0000   30980.0000   30980.0000   30980.0000
10  12   21980.0000   21980.0000   21980.0000   21980.0000
11  13   24780.0000   22480.0000   22480.0000   22480.0000
12  14   20480.0000         None         None         None
13  15   14980.0000   14980.0000   14980.0000   14980.0000
14  16   12980.0000         None         None         None